<?php

use Illuminate\Database\Seeder;

class ObjectiveTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $objective = new \App\Objective();

        $objective->insert([
            [
                'name'=> 'เพื่ออนุมัติ'
            ],
            [
                'name'=> 'เพื่ออนุติในหลักการ'
            ],
            [
                'name'=> 'เพื่ออนุมัติย้อนหลัง'
            ],
            [
                'name'=> 'เพื่ออนุมัติเบิกจ่าย'
            ],
            [
                'name'=> 'เพื่ออนุมัติหักล้าง'
            ],
            [
                'name'=> 'เพื่อขอความเห็นชอบ'
            ],
            [
                'name'=> 'เพื่อขอความเห็นชอบในหลักการ'
            ],
            [
                'name'=> 'เพื่อสั่งการ'
            ],
            [
                'name'=> 'เพื่อลงลายมือชื่อในเอกสารที่แนบมา'
            ],
            [
                'name'=> 'เพื่อทราบและส่งต่อ'
            ],
            [
                'name'=> 'เพื่อทราบและส่งแฟ้มประมวลเรื่องเดิม'
            ],
            [
                'name'=> 'เพื่อวิจารณ์และส่งต่อ'
            ],
            [
                'name'=> 'เพื่อวิจารณ์และส่งคืน'
            ],
            [
                'name'=> 'เพื่อให้ร่างหนังสือแล้วส่งคืน'
            ],
            [
                'name'=> 'เพื่อตรวจและส่งคืน'
            ],
            [
                'name'=> 'เพื่อกันเงินและกำหนดประภทงบประมาณ'
            ],
            [
                'name'=> 'เพื่อตรวจสอบเอกสารแล้วจ่ายเงิน'
            ],
            [
                'name'=> 'เพื่อทราบและเก็บไว้เป็นหลักฐาน'
            ],
            [
                'name'=> 'เพื่อดำเนินการต่อไปตามกรรมวิธี'
            ],
            [
                'name'=> 'เพื่อทราบและเก็บเข้าแฟ้มประมวลเรื่อง'
            ],
            [
                'name'=> 'เพื่อทราบและส่งคืน'
            ],
            [
                'name'=> 'เพื่อโปรดพิจารณาความเป็นไปได้ในการเสนอราคา'
            ]

        ]);
    }
}
